Tekla.Structures.Drawing.MarkSet.MarkSetAttributes
The MarkSetAttributes class is the attribute class for the mark set.

Tekla.Structures.Drawing.MarkSet.MarkSetAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.MarkSet.MarkSetAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file. Not implemented yet.
attributeFilename: The attribute file's filename.
Returns: False always.